# MaterialId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFamilyInstanceExtrusionExportResults..::..MaterialId Property
IFCFamilyInstanceExtrusionExportResults Class See Also
---
The best material id determined for the family instance.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId MaterialId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaterialId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MaterialId {
	ElementId^ get ();
}
```

# See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace